ruby-on-rails/testing-rails/app/controllers/friends_controller.rb

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone_number", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @friend.destroy!
---
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 4]]